# TEST ON SLICING AND INDEXING DATAFRAMES

In [2]:
import pandas as pd
import numpy as np
temp = pd.read_csv('../../temperatures.csv', index_col=0)
temp.head()

         date     city        country  avg_temp_c
0  2000-01-01  Abidjan  Côte D'Ivoire      27.293
1  2000-02-01  Abidjan  Côte D'Ivoire      27.685
2  2000-03-01  Abidjan  Côte D'Ivoire      29.061
3  2000-04-01  Abidjan  Côte D'Ivoire      28.162
4  2000-05-01  Abidjan  Côte D'Ivoire      27.547

## 1•  City Temperature Analysis:
	Create an analysis to find the average temperature for each city across different years. Filter the results to show only the cities with an average temperature above 25°C from 2000 to 2010.

In [11]:
temp['year'] = temp['date'].str[:4]
temp_above_25 = temp[temp['avg_temp_c'] > 25]
temp_city_year = temp_above_25.pivot_table('avg_temp_c', index='city', columns='year')
temp_city_year.loc[:, '2000':'2010']

year,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010
city,,,,,,,,,,,
Abidjan,27.128300,27.378333,27.046545,27.248000,27.420800,27.427900,26.988083,27.006833,26.944500,27.167182,27.445417
Ahmadabad,29.491111,29.112111,29.775556,29.262444,29.579111,29.552500,28.515800,29.393889,29.093667,29.873667,30.165444
Aleppo,28.872000,28.849500,28.358750,28.530250,28.348250,28.272250,28.622500,29.072000,29.099750,29.462000,29.958500
Alexandria,26.653333,27.434333,27.866667,26.721500,26.784667,27.215333,26.740500,27.008500,27.242000,27.036500,26.932600
Ankara,NaN,NaN,NaN,NaN,NaN,NaN,25.751000,NaN,NaN,NaN,26.044000
...,...,...,...,...,...,...,...,...,...,...,...
Tianjin,27.169333,26.445000,26.816000,25.774500,25.672000,26.441333,26.023333,26.483000,26.385500,26.066333,26.891000
Tokyo,25.528500,26.326000,25.658000,NaN,25.975000,25.567000,25.503000,26.360000,NaN,NaN,26.426500
Umm Durman,31.505556,31.016900,31.579800,30.769000,31.925778,30.929818,30.239636,30.975700,31.251600,31.669500,30.730167
Wuhan,28.379000,27.478750,27.918333,27.724000,27.540000,27.766000,28.773333,28.371333,27.276500,27.862250,27.401750
Xian,25.578000,26.094000,25.513000,NaN,NaN,25.045000,25.957000,NaN,NaN,25.500000,25.722000

## 2•  Country-Based Temperature Trends:
	Identify the cities in 'India' and 'China' and calculate the mean temperature for these cities from 2005 to 2012. Compare the results and determine which country had a higher average temperature during this period.

In [35]:
temp_ind_china = temp[temp['country'].isin(['India', 'China'])]
temp_ind_ch = temp_ind_china.pivot_table('avg_temp_c', index=['country'], columns='year').loc[:,'2005':'2010']

print('India has higher average temperature of 26 degrees')
temp_ind_ch.mean(axis='columns')

India has higher average temperature of 26 degrees

country
China    13.020714
India    26.666893
dtype: float64

## 3•  Maximum Temperature Comparison:
	Find the maximum temperature recorded for each city and then subset the data to include only the top 5 cities with the highest maximum temperatures. List these cities and their corresponding maximum temperatures.

In [40]:
temp_max = temp.pivot_table('avg_temp_c', index='city', aggfunc=np.max)
temp_max.sort_values('avg_temp_c', ascending=False).head()

           avg_temp_c
city
Baghdad        38.283
Riyadh         37.859
Jaipur         36.477
Delhi          36.339
New Delhi      36.339

## 4•  Yearly Temperature Range:
	Create a pivot table to show the range (difference between maximum and minimum) of temperatures for each city for the years 2003 to 2008. Identify the city with the highest range of temperatures.

In [57]:
temp_pt_yr = temp[(temp['year'] >= '2003') & (temp['year'] <= '2008')]
temp_pt = temp_pt_yr.pivot_table('avg_temp_c', index=['country','city'], aggfunc=[np.max,np.min])
temp_pt.columns = ['max_temp', 'min_temp']
temp_pt['temp_range'] = temp_pt['max_temp'] - temp_pt['min_temp']
temp_pt.sort_values('temp_range', ascending=False).head(20)

                                max_temp  min_temp  temp_range
country       city
China         Harbin              24.069   -18.862      42.931
              Changchun           24.103   -16.095      40.198
Canada        Montreal            21.636   -16.513      38.149
China         Shenyang            24.338   -11.366      35.704
Iran          Mashhad             26.771    -8.384      35.155
Russia        Moscow              19.809   -14.404      34.213
Canada        Toronto             21.605   -11.382      32.987
China         Taiyuan             24.138    -8.725      32.863
              Tianjin             27.687    -3.914      31.601
              Peking              27.687    -3.914      31.601
Russia        Saint Petersburg    19.782   -11.762      31.544
Turkey        Ankara              25.751    -5.183      30.934
United States New York            24.165    -6.325      30.490
Iraq          Baghdad             37.143     6.766      30.377
South Korea   Seoul               26.128    -4.235      30.363
China         Xian                25.957    -4.311      30.268
              Tangshan            26.646    -3.613      30.259
Ukraine       Kiev                21.693    -8.213      29.906
China         Dalian              24.855    -4.406      29.261
              Jinan               27.054    -1.858      28.912

## 5•  Seasonal Temperature Variations:
	Extract data for the months of June, July, and August for the years 2000 to 2010. Determine which city had the highest average summer temperature and provide the details.

In [59]:
temp['month'] = temp['date'].str[5:7]
temp.head()

         date     city        country  avg_temp_c  year month
0  2000-01-01  Abidjan  Côte D'Ivoire      27.293  2000    01
1  2000-02-01  Abidjan  Côte D'Ivoire      27.685  2000    02
2  2000-03-01  Abidjan  Côte D'Ivoire      29.061  2000    03
3  2000-04-01  Abidjan  Côte D'Ivoire      28.162  2000    04
4  2000-05-01  Abidjan  Côte D'Ivoire      27.547  2000    05

In [69]:
temp_year = temp[(temp['year'] >= '2000') & (temp['year'] <= '2010')]
temp_month = temp_year[temp['month'].isin(['06','07','08'])]
print('Riyadh has the highest average tempetature of 36.28 degrees')
temp_month.pivot_table('avg_temp_c', index=['country','city']).sort_values('avg_temp_c', ascending=False)

Riyadh has the highest average tempetature of 36.28 degrees

C:\Users\Divya\AppData\Local\Temp\ipykernel_14016\1130782665.py:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  temp_month = temp_year[temp['month'].isin(['06','07','08'])]

                         avg_temp_c
country      city
Saudi Arabia Riyadh       36.287788
Iraq         Baghdad      35.791879
Pakistan     Faisalabad   33.025364
             Lahore       33.025364
Saudi Arabia Jiddah       32.547394
...                             ...
Australia    Sydney       15.166576
Peru         Lima         14.712485
South Africa Cape Town    12.993939
Australia    Melbourne     9.245545
Chile        Santiago      0.141606

[100 rows x 1 columns]

## 6•  Multi-Level Index Analysis:
	Set a multi-level index with 'country' and 'city'. Slice the data to get temperature records for 'Australia' and 'Brazil' for the years 2001 to 2005. Calculate the average temperature for each city in these countries during this period.

In [76]:
temp_cou_city = temp.pivot_table('avg_temp_c', index=['country', 'city'], columns='year')
temp_cou_city.loc[['Australia', 'Brazil'], '2001':'2005'].mean(axis='columns')

country    city
Australia  Melbourne         14.072400
           Sydney            17.815683
Brazil     Belo Horizonte    22.072200
           Brasília          22.766633
           Fortaleza         27.860167
           Rio De Janeiro    24.818583
           Salvador          25.578417
           São Paulo         20.771017
dtype: float64

## 7•  Date-Based Slicing:
	The dataset is indexed by date. Slice the data to extract temperatures for the period from '2007-01-01' to '2009-12-31'. Identify the city with the lowest recorded temperature within this date range and provide the details.

In [101]:
temp['date'] = pd.to_datetime(temp['date'])
temp_date = temp.set_index('date')
temp_date.loc['2007-01-01':'2009-12-31'].sort_values('avg_temp_c')

                 city       country  avg_temp_c  year month
date
2008-01-01     Harbin         China     -18.649  2008    01
2009-12-01     Harbin         China     -17.856  2009    12
2009-01-01     Harbin         China     -17.157  2009    01
2008-01-01  Changchun         China     -16.095  2008    01
2009-01-01   Montreal        Canada     -15.132  2009    01
...               ...           ...         ...   ...   ...
2008-07-01    Baghdad          Iraq      36.400  2008    07
2007-07-01    Baghdad          Iraq      36.429  2007    07
2009-08-01     Riyadh  Saudi Arabia      36.607  2009    08
2008-07-01     Riyadh  Saudi Arabia      36.801  2008    07
2008-08-01    Baghdad          Iraq      37.143  2008    08

[3600 rows x 5 columns]

## 8•  Temperature Extremes:
	Find the cities that recorded temperatures below 10°C or above 35°C at any point in the dataset. Create a list of these cities along with the respective minimum and maximum temperatures recorded.

## 9•  Pivot Table with Missing Values:
	Create a pivot table to find the average temperature for each city in 'United States' and 'Canada' for each year from 2000 to 2010. Fill any missing values with the overall average temperature of the respective country.

## 10•  Historical Temperature Comparison:
	Compare the average temperatures of 'London' and 'New York' for each year from 2000 to 2012. Identify the year in which the difference in average temperature between these two cities was the greatest and provide the details.